# -*- coding: utf-8 -*-
"""Lvl_2 task 2.3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1I12au1nCXguDq25kFHmqGhQGOvubzO1Q
"""

# Задача 2.3.

# Напишите функцию, которая принимает цифры от 0 до 9 и возвращает значение прописью.
# Например,
# switch_it_up(1) -> 'One'
# switch_it_up(3) -> 'Three'
# switch_it_up(10000) -> None
# Использовать условный оператор if-elif-else нельзя!

number = int(input("Введите число от 0 до 9:"))

def switch_it_up(number):
  in_words = ['Zero', 'One', 'Two', 'Three', 'Four', 'Five', 'Six', 'Seven', 'Eight', 'Nine']
  print(in_words[number])

switch_it_up(number)